Part 5 Steady Flow/20-mesh-2/system/blockMeshDict
// Lf = 4 
// Lw = 10 
// R = 1 
// H = 4 
// D = 1 

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices (
(0.5000 0.0000 -0.0500)
(0.3536 0.3536 -0.0500)
(0.0000 0.5000 -0.0500)
(-0.3536 0.3536 -0.0500)
(-0.5000 0.0000 -0.0500)
(-0.3536 -0.3536 -0.0500)
(0.0000 -0.5000 -0.0500)
(0.3536 -0.3536 -0.0500)
(1.5000 0.0000 -0.0500)
(1.0607 1.0607 -0.0500)
(0.0000 1.5000 -0.0500)
(-1.0607 1.0607 -0.0500)
(-1.5000 0.0000 -0.0500)
(-1.0607 -1.0607 -0.0500)
(0.0000 -1.5000 -0.0500)
(1.0607 -1.0607 -0.0500)
(10.0000 0.0000 -0.0500)
(10.0000 1.0607 -0.0500)
(10.0000 4.0000 -0.0500)
(1.0607 4.0000 -0.0500)
(0.0000 4.0000 -0.0500)
(-1.0607 4.0000 -0.0500)
(-4.0000 4.0000 -0.0500)
(-4.0000 1.0607 -0.0500)
(-4.0000 0.0000 -0.0500)
(-4.0000 -1.0607 -0.0500)
(-4.0000 -4.0000 -0.0500)
(-1.0607 -4.0000 -0.0500)
(0.0000 -4.0000 -0.0500)
(1.0607 -4.0000 -0.0500)
(10.0000 -4.0000 -0.0500)
(10.0000 -1.0607 -0.0500)
(0.5000 0.0000 0.0500)
(0.3536 0.3536 0.0500)
(0.0000 0.5000 0.0500)
(-0.3536 0.3536 0.0500)
(-0.5000 0.0000 0.0500)
(-0.3536 -0.3536 0.0500)
(0.0000 -0.5000 0.0500)
(0.3536 -0.3536 0.0500)
(1.5000 0.0000 0.0500)
(1.0607 1.0607 0.0500)
(0.0000 1.5000 0.0500)
(-1.0607 1.0607 0.0500)
(-1.5000 0.0000 0.0500)
(-1.0607 -1.0607 0.0500)
(0.0000 -1.5000 0.0500)
(1.0607 -1.0607 0.0500)
(10.0000 0.0000 0.0500)
(10.0000 1.0607 0.0500)
(10.0000 4.0000 0.0500)
(1.0607 4.0000 0.0500)
(0.0000 4.0000 0.0500)
(-1.0607 4.0000 0.0500)
(-4.0000 4.0000 0.0500)
(-4.0000 1.0607 0.0500)
(-4.0000 0.0000 0.0500)
(-4.0000 -1.0607 0.0500)
(-4.0000 -4.0000 0.0500)
(-1.0607 -4.0000 0.0500)
(0.0000 -4.0000 0.0500)
(1.0607 -4.0000 0.0500)
(10.0000 -4.0000 0.0500)
(10.0000 -1.0607 0.0500)
);

blocks (
// block 0
hex (0 8 9 1 32 40 41 33) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 1
hex (1 9 10 2 33 41 42 34) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 2
hex (2 10 11 3 34 42 43 35) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 3
hex (3 11 12 4 35 43 44 36) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 4
hex (4 12 13 5 36 44 45 37) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 5
hex (5 13 14 6 37 45 46 38) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 6
hex (6 14 15 7 38 46 47 39) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 7
hex (7 15 8 0 39 47 40 32) (20 40 1) simpleGrading (2.0 1.0 1.0)
// block 8
hex (8 16 17 9 40 48 49 41) (100 40 1) simpleGrading (4.0 1.0 1.0)
// block 9
hex (9 17 18 19 41 49 50 51) (100 60 1) simpleGrading (4.0 4.0 1.0)
// block 10
hex (10 9 19 20 42 41 51 52) (40 60 1) simpleGrading (1.0 4.0 1.0)
// block 11
hex (11 10 20 21 43 42 52 53) (40 60 1) simpleGrading (1.0 4.0 1.0)
// block 12
hex (23 11 21 22 55 43 53 54) (30 60 1) simpleGrading (2.5e-01 4.0 1.0)
// block 13
hex (24 12 11 23 56 44 43 55) (30 40 1) simpleGrading (2.5e-01 1.0 1.0)
// block 14
hex (25 13 12 24 57 45 44 56) (30 40 1) simpleGrading (2.5e-01 1.0 1.0)
// block 15
hex (26 27 13 25 58 59 45 57) (30 60 1) simpleGrading (2.5e-01 2.5e-01 1.0)
// block 16
hex (27 28 14 13 59 60 46 45) (40 60 1) simpleGrading (1.0 2.5e-01 1.0)
// block 17
hex (28 29 15 14 60 61 47 46) (40 60 1) simpleGrading (1.0 2.5e-01 1.0)
// block 18
hex (29 30 31 15 61 62 63 47) (100 60 1) simpleGrading (4.0 2.5e-01 1.0)
// block 19
hex (15 31 16 8 47 63 48 40) (100 40 1) simpleGrading (4.0 1.0 1.0)
);

edges (
arc 0 1 (0.4619 0.1913 -0.0500)
arc 8 9 (1.3858 0.5740 -0.0500)
arc 32 33 (0.4619 0.1913 0.0500)
arc 40 41 (1.3858 0.5740 0.0500)
arc 1 2 (0.1913 0.4619 -0.0500)
arc 9 10 (0.5740 1.3858 -0.0500)
arc 33 34 (0.1913 0.4619 0.0500)
arc 41 42 (0.5740 1.3858 0.0500)
arc 2 3 (-0.1913 0.4619 -0.0500)
arc 10 11 (-0.5740 1.3858 -0.0500)
arc 34 35 (-0.1913 0.4619 0.0500)
arc 42 43 (-0.5740 1.3858 0.0500)
arc 3 4 (-0.4619 0.1913 -0.0500)
arc 11 12 (-1.3858 0.5740 -0.0500)
arc 35 36 (-0.4619 0.1913 0.0500)
arc 43 44 (-1.3858 0.5740 0.0500)
arc 4 5 (-0.4619 -0.1913 -0.0500)
arc 12 13 (-1.3858 -0.5740 -0.0500)
arc 36 37 (-0.4619 -0.1913 0.0500)
arc 44 45 (-1.3858 -0.5740 0.0500)
arc 5 6 (-0.1913 -0.4619 -0.0500)
arc 13 14 (-0.5740 -1.3858 -0.0500)
arc 37 38 (-0.1913 -0.4619 0.0500)
arc 45 46 (-0.5740 -1.3858 0.0500)
arc 6 7 (0.1913 -0.4619 -0.0500)
arc 14 15 (0.5740 -1.3858 -0.0500)
arc 38 39 (0.1913 -0.4619 0.0500)
arc 46 47 (0.5740 -1.3858 0.0500)
arc 7 0 (0.4619 -0.1913 -0.0500)
arc 15 8 (1.3858 -0.5740 -0.0500)
arc 39 32 (0.4619 -0.1913 0.0500)
arc 47 40 (1.3858 -0.5740 0.0500)
);


boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)        
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);
